<script setup lang="ts">
</script>

<template>
    <div class="subject">
        <div class="top-entry">
            <div class="left-item">
                <svg t="1694794241660" class="title-icon" viewBox="0 0 1024 1024" version="1.1"
                    xmlns="http://www.w3.org/2000/svg" p-id="4212" width="24" height="24">
                    <path
                        d="M128 256a128 128 0 0 1 128-128h106.666667a128 128 0 0 1 128 128v192a42.666667 42.666667 0 0 1-42.666667 42.666667h-192a128 128 0 0 1-128-128v-106.666667z m128-42.666667a42.666667 42.666667 0 0 0-42.666667 42.666667v106.666667a42.666667 42.666667 0 0 0 42.666667 42.666666h149.333333v-149.333333a42.666667 42.666667 0 0 0-42.666666-42.666667h-106.666667zM128 661.333333a128 128 0 0 1 128-128h192a42.666667 42.666667 0 0 1 42.666667 42.666667v192a128 128 0 0 1-128 128h-106.666667a128 128 0 0 1-128-128v-106.666667z m128-42.666666a42.666667 42.666667 0 0 0-42.666667 42.666666v106.666667a42.666667 42.666667 0 0 0 42.666667 42.666667h106.666667a42.666667 42.666667 0 0 0 42.666666-42.666667v-149.333333h-149.333333zM533.333333 576a42.666667 42.666667 0 0 1 42.666667-42.666667h192a128 128 0 0 1 128 128v106.666667a128 128 0 0 1-128 128h-106.666667a128 128 0 0 1-128-128v-192z m85.333334 42.666667v149.333333a42.666667 42.666667 0 0 0 42.666666 42.666667h106.666667a42.666667 42.666667 0 0 0 42.666667-42.666667v-106.666667a42.666667 42.666667 0 0 0-42.666667-42.666666h-149.333333zM554.666667 266.666667h320v85.333333H554.666667v-85.333333z"
                        fill="#d81e06" p-id="4213"></path>
                    <path d="M757.333333 149.333333v320h-85.333333V149.333333h85.333333z" fill="#d81e06" p-id="4214"></path>
                </svg>
                <span class="small-title">常见科室</span>
            </div>
            <div class="right-item">
                <span >全部</span>
                <svg t="1694795870350" class="all-icon" viewBox="0 0 1024 1024" version="1.1"
                    xmlns="http://www.w3.org/2000/svg" p-id="5785" width="24" height="24">
                    <path
                        d="M692.9 492.2c0 7.70000001-2.90000001 15.4-8.8 21.2L382.3 815.20000001c-11.7 11.7-30.7 11.7-42.4-1e-8s-11.7-30.7 0-42.4l280.5-280.5-280.5-280.5c-11.7-11.7-11.7-30.7 0-42.4s30.7-11.7 42.4 1e-8L684.1 471c5.8 5.9 8.8 13.5 8.8 21.2z"
                        p-id="5786"></path>
                </svg>

            </div>
        </div>
        <div class="seperator"></div>
        <div class="bottom-entry">
            <ul class="list">
                <li class="subject-item">神经内科</li>
                <li class="subject-item">消化内科</li>
                <li class="subject-item">呼吸内科</li>
                <li class="subject-item">耳鼻咽喉科</li>
                <li class="subject-item">神经外科</li>
                <li class="subject-item">妇产科</li>
                <li class="subject-item">儿科</li>
            </ul>
        </div>
    </div>
    <div class="platform">
        <div class="top-entry">
            <div class="left-item">
                <svg t="1694796832235" class="icon" viewBox="0 0 1024 1024" version="1.1" xmlns="http://www.w3.org/2000/svg"
                    p-id="6857" width="24" height="24">
                    <path d="M342 391.1h24.7v180.4H342z" fill="#FFFFFF" p-id="6858"></path>
                    <path
                        d="M404.6 711.5c-0.4 3.7-0.6 7.5-0.6 11.2v70c0 59.7 48.4 108 108 108 59.7 0 108-48.4 108-108v-70c0-3.8-0.2-7.5-0.6-11.2H404.6z m0 0"
                        fill="#CCE5F6" p-id="6859"></path>
                    <path
                        d="M512 923.9c-72.3 0-131.1-58.8-131.1-131.1v-70c0-4.5 0.2-9.1 0.7-13.6 1.2-11.8 11.1-20.7 23-20.7h214.9c11.8 0 21.8 8.9 23 20.7 0.5 4.5 0.7 9.1 0.7 13.6v70c-0.1 72.3-58.9 131.1-131.2 131.1z m-84.9-189.3v58.1c0 46.8 38.1 84.9 84.9 84.9 46.8 0 84.9-38.1 84.9-84.9v-58.1H427.1z m148-477.2c-0.8 0-1.6 0-2.4-0.1-12.7-1.3-21.9-12.7-20.6-25.4 0.1-1.4 0.2-2.8 0.2-4.2v-41.1c0-22.2-18.1-40.3-40.3-40.3-22.2 0-40.3 18.1-40.3 40.3v41.1c0 1.4 0.1 2.8 0.2 4.2 1.3 12.7-7.9 24.1-20.6 25.4-12.7 1.3-24.1-7.9-25.4-20.6-0.3-3-0.5-6-0.5-9v-41.1c0-47.7 38.8-86.5 86.5-86.5s86.5 38.8 86.5 86.5v41.1c0 3-0.2 6-0.5 9-1.1 11.9-11.1 20.7-22.8 20.7z m0 0"
                        fill="#2197EF" p-id="6860"></path>
                    <path
                        d="M756.7 616.9c-12.8 0-23.1-10.3-23.1-23.1V481.3c0-122.2-99.4-221.6-221.6-221.6-122.2 0-221.6 99.4-221.6 221.6v112.5c0 12.8-10.3 23.1-23.1 23.1s-23.1-10.3-23.1-23.1V481.3c0-147.7 120.2-267.8 267.8-267.8 147.7 0 267.9 120.2 267.9 267.8v112.5c0 12.8-10.4 23.1-23.2 23.1z m0 0"
                        fill="#2197EF" p-id="6861"></path>
                    <path d="M168.3 677h687.5v113.6H168.3z" fill="#CCE5F6" p-id="6862"></path>
                    <path
                        d="M855.7 813.7H168.3c-12.8 0-23.1-10.3-23.1-23.1V677c0-12.8 10.3-23.1 23.1-23.1h687.5c12.8 0 23.1 10.4 23.1 23.1v113.6c0 12.8-10.4 23.1-23.2 23.1z m-664.3-46.2h641.3v-67.4H191.4v67.4z m0 0"
                        fill="#2197EF" p-id="6863"></path>
                </svg>

                <span class="small-title">平台公告</span>
            </div>
            <div class="right-item">
                <span>全部</span>
                <svg t="1694795870350" class="all-icon" viewBox="0 0 1024 1024" version="1.1"
                    xmlns="http://www.w3.org/2000/svg" p-id="5785" width="24" height="24">
                    <path
                        d="M692.9 492.2c0 7.70000001-2.90000001 15.4-8.8 21.2L382.3 815.20000001c-11.7 11.7-30.7 11.7-42.4-1e-8s-11.7-30.7 0-42.4l280.5-280.5-280.5-280.5c-11.7-11.7-11.7-30.7 0-42.4s30.7-11.7 42.4 1e-8L684.1 471c5.8 5.9 8.8 13.5 8.8 21.2z"
                        p-id="5786"></path>
                </svg>
            </div>
        </div>
        <div class="seperator"></div>
        <div class="bottom-entry">
            <ul class="msg-list">
                <li class="msg-item">关于延长北京大学国际医院就诊时间的通知</li>
                <li class="msg-item">北京中医药大学东方医院部分医保政策变化通知</li>
                <li class="msg-item">武警总医院号源暂停更新通知</li>
            </ul>

        </div>
    </div>
    <div class="stop-visit">
        <div class="top-entry">
            <div class="left-item">
                <svg t="1694798225973" class="title-icon" viewBox="0 0 1026 1024" version="1.1" xmlns="http://www.w3.org/2000/svg"
                    p-id="7005" width="20" height="20">
                    <path
                        d="M115.479782 1024A115.536809 115.536809 0 0 1 0 908.520218V335.284284a115.479782 115.479782 0 0 1 115.536809-115.479782H280.5731L489.805356 10.686299a34.216232 34.216232 0 0 1 7.014328-5.702705 35.470827 35.470827 0 0 1 32.790555-1.710811l1.596758 0.741351 2.566217 1.482704 0.627297 0.399189a38.436234 38.436234 0 0 1 3.991894 3.079461l1.425676 1.311622 209.17523 209.118203h161.899803A115.479782 115.479782 0 0 1 1026.48695 335.284284v573.12188a115.479782 115.479782 0 0 1-115.479782 115.479782z m-41.059478-681.758416v555.899711a50.297861 50.297861 0 0 0 50.354887 50.29786H902.738245a50.297861 50.297861 0 0 0 50.297861-50.29786V342.241584a50.297861 50.297861 0 0 0-50.297861-50.29786H821.18956l50.012725 50.012725a35.470827 35.470827 0 0 1-50.126779 50.126779l-100.139505-100.139504H308.687437L208.547932 392.083228a35.470827 35.470827 0 0 1-50.126779-50.126779l50.012725-50.012725H124.832219a50.297861 50.297861 0 0 0-50.411915 50.29786z m306.349327-122.380055h268.027148L514.783205 85.904982zM263.636065 797.716655a29.254878 29.254878 0 1 1 0-57.027053h499.499955a29.254878 29.254878 0 1 1 0 57.027053z m0-228.108211a29.254878 29.254878 0 1 1 0-57.027053h499.499955a29.254878 29.254878 0 1 1 0 57.027053z"
                        fill="#f4ea2a" p-id="7006"></path>
                </svg>

                <span class="small-title">停诊公告</span>
            </div>
            <div class="right-item">
                <span>全部</span>
                <svg t="1694795870350" class="all-icon" viewBox="0 0 1024 1024" version="1.1"
                    xmlns="http://www.w3.org/2000/svg" p-id="5785" width="24" height="24">
                    <path
                        d="M692.9 492.2c0 7.70000001-2.90000001 15.4-8.8 21.2L382.3 815.20000001c-11.7 11.7-30.7 11.7-42.4-1e-8s-11.7-30.7 0-42.4l280.5-280.5-280.5-280.5c-11.7-11.7-11.7-30.7 0-42.4s30.7-11.7 42.4 1e-8L684.1 471c5.8 5.9 8.8 13.5 8.8 21.2z"
                        p-id="5786"></path>
                </svg>
            </div>
        </div>
        <div class="seperator"></div>
        <div class="bottom-entry">
            <ul class="msg-list">
                <li class="msg-item">关于延长北京大学国际医院就诊时间的通知</li>
                <li class="msg-item">北京中医药大学东方医院部分医保政策变化通知</li>
                <li class="msg-item">武警总医院号源暂停更新通知</li>
            </ul>

        </div>
    </div>
</template>

<style scoped>
.small-title {
    font-size: 1.2rem;
}

.subject {
    margin-bottom: 30px;
}
.platform{
    margin-bottom: 30px;
}
.top-entry {
    display: flex;
    justify-content: space-between;
    align-items: center;
    margin-bottom: 5px;
}
.bottom-entry {}

.left-item {
    display: flex;
    align-items: center;
}

.right-item {
    display: flex;
    align-items: center;
    cursor: pointer;
}

.seperator {
    width: 100%;
    background-color: #7F7F7F;
    box-shadow: 0px 1px 5px 1px #e3e3e3;
    height: 1px;
    margin-bottom: 20px;
}

.title-icon {
    margin-right: 10px;
}

.all-icon {
    margin-left: 5px;
}

li {
    cursor: pointer;
    transition: all 0.3s;
}

li:hover{
    color: #C2B800;
}

.msg-item {
    color: #7F7F7F;
    overflow: hidden;
    text-overflow: ellipsis;
    white-space: nowrap;
    margin-bottom: 15px;
}

.list {
    display: flex;
    flex-wrap: wrap;

}

.subject-item {
    flex-basis: 50%;
    margin-bottom: 15px;
    color: #7F7F7F;
}</style>